auth/app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def update
    respond_to do |format|
      new_role = @account.role != account_params[:role] ? account_params[:role] : nil

      if @account.update(account_params)
---
UPDATE "accounts" SET "full_name" = $1, "updated_at" = $2, "role" = $3 WHERE "accounts"."id" = $4  [["full_name", "Popug2"], ["updated_at", "2022-05-12 06:58:41.610767"], ["role", "admin"], ["id", 3]]

    def current_account
      if doorkeeper_token
        Account.find(doorkeeper_token.resource_owner_id)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_account
      @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]